app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
    def index
        @Authors = Author.all

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @Author = Author.find(params[:id])

INSERT INTO "authors" ("name", "book", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tom Calncy"], ["book", "Jack Ryan"], ["created_at", "2023-01-30 10:14:55.005969"], ["updated_at", "2023-01-30 10:14:55.005969"]]
---
    def create
        @Author = Author.create(
            name: params[:name],
            book: params[:book]
        )