app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "user_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", nil], ["user_name", "madhu"], ["email", "madhu@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-01-31 10:09:45.798802"], ["updated_at", "2023-01-31 10:09:45.798802"]]